Revit 2026 API

# MeshTransformed Property

---

Transforms this mesh and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Mesh this[
	Transform transform
] { get; }
```
```vb
Public ReadOnly Property Transformed (
	transform As Transform
) As Mesh
	Get
```
```cpp
public:
property Mesh^ Transformed[Transform^ transform] {
	Mesh^ get (Transform^ transform);
}
```
```fsharp
member Transformed : Mesh with get
```

#### Parameters

transform Transform
    The transformation used to transform the profile.

#### Return Value

MeshThe transformed mesh.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the handle of the specified transformation is . |

#### Reference

Mesh Class

Autodesk.Revit.DB Namespace